app/controllers/posts_controller.rb

  def show
    @post = Post.where(slug: params[:id]).first
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'some-string' ORDER BY "posts"."id" ASC LIMIT 1

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "slug", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Some text."], ["created_at", Thu, 18 Jul 2013 21:13:52 UTC +00:00], ["slug", "some-string"], ["title", "Some string"], ["updated_at", Thu, 18 Jul 2013 21:13:52 UTC +00:00]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = 1  [["body", "# Test"], ["updated_at", Thu, 18 Jul 2013 18:27:00 UTC +00:00]]

    def set_post
      @post = Post.where(slug: params[:id]).first
---
SELECT "posts".* FROM "posts" WHERE ("slug" = 'some-string' OR "slug" LIKE 'some-string--%') ORDER BY LENGTH("slug") DESC, "slug" DESC LIMIT 1